wrk_bench/h1_async_1ms_delay.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 3.155ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.615ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.651ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.650ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.51ms    1.71ms  22.21ms   86.99%
    Req/Sec    15.83k     5.22k   28.22k    63.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.20ms
 75.000%    4.02ms
 90.000%    4.93ms
 99.000%   11.57ms
 99.900%   15.63ms
 99.990%   20.00ms
 99.999%   21.85ms
100.000%   22.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.057     0.000000            1         1.00
       2.015     0.100000       293006         1.11
       2.367     0.200000       585410         1.25
       2.651     0.300000       879199         1.43
       2.921     0.400000      1170989         1.67
       3.199     0.500000      1462816         2.00
       3.345     0.550000      1609325         2.22
       3.497     0.600000      1755705         2.50
       3.657     0.650000      1901872         2.86
       3.829     0.700000      2047830         3.33
       4.021     0.750000      2194356         4.00
       4.127     0.775000      2268402         4.44
       4.243     0.800000      2341530         5.00
       4.375     0.825000      2414908         5.71
       4.523     0.850000      2486495         6.67
       4.703     0.875000      2560076         8.00
       4.807     0.887500      2596654         8.89
       4.927     0.900000      2633546        10.00
       5.063     0.912500      2669286        11.43
       5.239     0.925000      2706330        13.33
       5.475     0.937500      2742299        16.00
       5.639     0.943750      2760673        17.78
       5.855     0.950000      2778948        20.00
       6.171     0.956250      2797293        22.86
       6.731     0.962500      2815434        26.67
       7.643     0.968750      2833719        32.00
       8.175     0.971875      2842892        35.56
       8.687     0.975000      2852085        40.00
       9.191     0.978125      2861166        45.71
       9.735     0.981250      2870273        53.33
      10.311     0.984375      2879508        64.00
      10.631     0.985938      2884083        71.11
      10.975     0.987500      2888604        80.00
      11.351     0.989062      2893159        91.43
      11.719     0.990625      2897699       106.67
      12.119     0.992188      2902323       128.00
      12.327     0.992969      2904556       142.22
      12.543     0.993750      2906840       160.00
      12.767     0.994531      2909168       182.86
      13.031     0.995313      2911445       213.33
      13.303     0.996094      2913705       256.00
      13.471     0.996484      2914878       284.44
      13.655     0.996875      2916015       320.00
      13.863     0.997266      2917118       365.71
      14.111     0.997656      2918294       426.67
      14.415     0.998047      2919432       512.00
      14.599     0.998242      2919974       568.89
      14.791     0.998437      2920561       640.00
      15.007     0.998633      2921118       731.43
      15.279     0.998828      2921692       853.33
      15.671     0.999023      2922269      1024.00
      15.855     0.999121      2922547      1137.78
      16.135     0.999219      2922836      1280.00
      16.463     0.999316      2923125      1462.86
      16.767     0.999414      2923405      1706.67
      17.103     0.999512      2923690      2048.00
      17.295     0.999561      2923832      2275.56
      17.503     0.999609      2923981      2560.00
      17.695     0.999658      2924116      2925.71
      17.887     0.999707      2924259      3413.33
      18.239     0.999756      2924408      4096.00
      18.415     0.999780      2924474      4551.11
      18.639     0.999805      2924544      5120.00
      18.879     0.999829      2924617      5851.43
      19.311     0.999854      2924689      6826.67
      19.647     0.999878      2924758      8192.00
      19.839     0.999890      2924796      9102.22
      20.047     0.999902      2924830     10240.00
      20.319     0.999915      2924866     11702.86
      20.479     0.999927      2924904     13653.33
      20.671     0.999939      2924938     16384.00
      20.799     0.999945      2924956     18204.44
      20.879     0.999951      2924973     20480.00
      20.975     0.999957      2924992     23405.71
      21.215     0.999963      2925008     27306.67
      21.359     0.999969      2925027     32768.00
      21.423     0.999973      2925035     36408.89
      21.503     0.999976      2925047     40960.00
      21.567     0.999979      2925053     46811.43
      21.647     0.999982      2925063     54613.33
      21.727     0.999985      2925072     65536.00
      21.775     0.999986      2925076     72817.78
      21.823     0.999988      2925083     81920.00
      21.839     0.999989      2925085     93622.86
      21.855     0.999991      2925090    109226.67
      21.919     0.999992      2925093    131072.00
      21.951     0.999993      2925096    145635.56
      21.983     0.999994      2925101    163840.00
      21.983     0.999995      2925101    187245.71
      22.015     0.999995      2925104    218453.33
      22.015     0.999996      2925104    262144.00
      22.031     0.999997      2925107    291271.11
      22.031     0.999997      2925107    327680.00
      22.047     0.999997      2925108    374491.43
      22.063     0.999998      2925109    436906.67
      22.095     0.999998      2925111    524288.00
      22.095     0.999998      2925111    582542.22
      22.095     0.999998      2925111    655360.00
      22.159     0.999999      2925112    748982.86
      22.159     0.999999      2925112    873813.33
      22.175     0.999999      2925113   1048576.00
      22.175     0.999999      2925113   1165084.44
      22.175     0.999999      2925113   1310720.00
      22.191     0.999999      2925114   1497965.71
      22.191     0.999999      2925114   1747626.67
      22.191     1.000000      2925114   2097152.00
      22.191     1.000000      2925114   2330168.89
      22.191     1.000000      2925114   2621440.00
      22.223     1.000000      2925115   2995931.43
      22.223     1.000000      2925115          inf
#[Mean    =        3.509, StdDeviation   =        1.713]
#[Max     =       22.208, Total count    =      2925115]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3543808 requests in 1.00m, 6.91GB read
Requests/sec:  59063.37
Transfer/sec:    117.95MB