wrk_bench/h1_async_1ms_delay.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 4.883ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.871ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.459ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.076ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.71ms    2.09ms  22.18ms   79.70%
    Req/Sec    15.62k     2.80k   25.77k    67.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.41ms
 75.000%    5.53ms
 90.000%    6.79ms
 99.000%   13.58ms
 99.900%   17.36ms
 99.990%   20.05ms
 99.999%   21.06ms
100.000%   22.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.130     0.000000            1         1.00
       2.595     0.100000       293322         1.11
       3.157     0.200000       585892         1.25
       3.621     0.300000       878120         1.43
       4.025     0.400000      1171091         1.67
       4.407     0.500000      1463500         2.00
       4.603     0.550000      1610974         2.22
       4.803     0.600000      1756068         2.50
       5.019     0.650000      1902427         2.86
       5.255     0.700000      2048644         3.33
       5.527     0.750000      2195496         4.00
       5.675     0.775000      2266872         4.44
       5.839     0.800000      2340098         5.00
       6.027     0.825000      2414319         5.71
       6.239     0.850000      2487343         6.67
       6.483     0.875000      2559555         8.00
       6.627     0.887500      2596473         8.89
       6.787     0.900000      2632918        10.00
       6.971     0.912500      2669058        11.43
       7.199     0.925000      2706064        13.33
       7.487     0.937500      2742468        16.00
       7.663     0.943750      2760356        17.78
       7.891     0.950000      2778781        20.00
       8.199     0.956250      2797077        22.86
       8.703     0.962500      2815308        26.67
       9.639     0.968750      2833555        32.00
      10.255     0.971875      2842702        35.56
      10.831     0.975000      2851836        40.00
      11.375     0.978125      2861006        45.71
      11.903     0.981250      2870137        53.33
      12.455     0.984375      2879220        64.00
      12.751     0.985938      2883824        71.11
      13.063     0.987500      2888316        80.00
      13.391     0.989062      2892973        91.43
      13.719     0.990625      2897531       106.67
      14.063     0.992188      2902086       128.00
      14.247     0.992969      2904395       142.22
      14.431     0.993750      2906601       160.00
      14.639     0.994531      2908967       182.86
      14.871     0.995313      2911178       213.33
      15.167     0.996094      2913495       256.00
      15.351     0.996484      2914638       284.44
      15.551     0.996875      2915742       320.00
      15.791     0.997266      2916905       365.71
      16.031     0.997656      2918044       426.67
      16.351     0.998047      2919168       512.00
      16.559     0.998242      2919776       568.89
      16.735     0.998437      2920317       640.00
      16.927     0.998633      2920902       731.43
      17.135     0.998828      2921450       853.33
      17.391     0.999023      2922034      1024.00
      17.535     0.999121      2922330      1137.78
      17.679     0.999219      2922595      1280.00
      17.855     0.999316      2922889      1462.86
      18.047     0.999414      2923172      1706.67
      18.287     0.999512      2923456      2048.00
      18.447     0.999561      2923593      2275.56
      18.575     0.999609      2923734      2560.00
      18.719     0.999658      2923882      2925.71
      18.879     0.999707      2924024      3413.33
      19.087     0.999756      2924170      4096.00
      19.215     0.999780      2924237      4551.11
      19.359     0.999805      2924306      5120.00
      19.487     0.999829      2924378      5851.43
      19.647     0.999854      2924455      6826.67
      19.839     0.999878      2924519      8192.00
      19.951     0.999890      2924557      9102.22
      20.063     0.999902      2924594     10240.00
      20.143     0.999915      2924629     11702.86
      20.239     0.999927      2924670     13653.33
      20.319     0.999939      2924705     16384.00
      20.351     0.999945      2924718     18204.44
      20.383     0.999951      2924734     20480.00
      20.431     0.999957      2924756     23405.71
      20.479     0.999963      2924772     27306.67
      20.575     0.999969      2924787     32768.00
      20.655     0.999973      2924798     36408.89
      20.719     0.999976      2924805     40960.00
      20.751     0.999979      2924816     46811.43
      20.799     0.999982      2924825     54613.33
      20.943     0.999985      2924832     65536.00
      20.991     0.999986      2924838     72817.78
      21.039     0.999988      2924845     81920.00
      21.039     0.999989      2924845     93622.86
      21.103     0.999991      2924851    109226.67
      21.183     0.999992      2924854    131072.00
      21.263     0.999993      2924856    145635.56
      21.391     0.999994      2924859    163840.00
      21.471     0.999995      2924861    187245.71
      21.567     0.999995      2924863    218453.33
      21.647     0.999996      2924865    262144.00
      21.743     0.999997      2924866    291271.11
      21.807     0.999997      2924868    327680.00
      21.839     0.999997      2924869    374491.43
      21.919     0.999998      2924870    436906.67
      21.935     0.999998      2924871    524288.00
      21.935     0.999998      2924871    582542.22
      22.127     0.999998      2924872    655360.00
      22.143     0.999999      2924873    748982.86
      22.143     0.999999      2924873    873813.33
      22.159     0.999999      2924874   1048576.00
      22.159     0.999999      2924874   1165084.44
      22.159     0.999999      2924874   1310720.00
      22.175     0.999999      2924875   1497965.71
      22.175     0.999999      2924875   1747626.67
      22.175     1.000000      2924875   2097152.00
      22.175     1.000000      2924875   2330168.89
      22.175     1.000000      2924875   2621440.00
      22.191     1.000000      2924876   2995931.43
      22.191     1.000000      2924876          inf
#[Mean    =        4.711, StdDeviation   =        2.088]
#[Max     =       22.176, Total count    =      2924876]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3543336 requests in 1.00m, 6.91GB read
Requests/sec:  59055.38
Transfer/sec:    117.93MB